--[[
运算符主要包括以下几部分
    - 算数运算符
        - + 加法
        - - 减法
        - * 乘法
        - / 除法(默认带小数点)
        - % 取余
        - ^ 乘幂
        - - 负号
        - // 整除(lua > 5.2)
    - 关系运算符
        == 相等
        ~= 不相等
        > 大于
        < 小于
        >= 大于等于
        <= 小于等于
    - 逻辑运算符
        and 与运算
        or 或运算
        not 非运算
    - 其他运算符
        ... 字符串连接符号
        # table 和字符串取长度负号
--]]
a = 10
b = 3
print("a + b = ", a + b)
print("a - b = ", a - b)
print("a * b = ", a * b)
print("a / b = ", a / b)
print("a ^ b = ", a ^ b)
print("a % b = ", a % b)
print("- a = ", - a)
print("a // b = ", a // b)